awei7086/SCP_20260131/c2000.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "F28002x" --package "80QFP" --part "F28002x_80QFP" --context "system" --product "C2000WARE@5.01.00.00"
 * @versions {"tool":"1.18.1+3343"}
 */

/**
 * Import the modules used in this configuration.
 */
const adc       = scripting.addModule("/driverlib/adc.js", {}, false);
const adc1      = adc.addInstance();
const adc2      = adc.addInstance();
const cputimer  = scripting.addModule("/driverlib/cputimer.js", {}, false);
const cputimer1 = cputimer.addInstance();
const epwm      = scripting.addModule("/driverlib/epwm.js", {}, false);
const epwm1     = epwm.addInstance();
const epwm2     = epwm.addInstance();
const epwm3     = epwm.addInstance();
const epwm4     = epwm.addInstance();
// I2C removed from SysConfig - Board_init() has GMUX bug on GPIO26 (mux=11)
// I2C initialized manually in InitI2C() after Board_init()
// const i2c       = scripting.addModule("/driverlib/i2c.js", {}, false);
// const i2c1      = i2c.addInstance();
const gpio      = scripting.addModule("/driverlib/gpio.js", {}, false);
const gpio1     = gpio.addInstance();
const gpio2     = gpio.addInstance();
const gpio3     = gpio.addInstance();
const gpio4     = gpio.addInstance();
const gpio5     = gpio.addInstance();
const gpio6     = gpio.addInstance();
const gpio7     = gpio.addInstance();
const gpio8     = gpio.addInstance();
const gpio9     = gpio.addInstance();
const gpio10    = gpio.addInstance();
const gpio11    = gpio.addInstance();
const gpio12    = gpio.addInstance();
const gpio13    = gpio.addInstance();
const gpio14    = gpio.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
adc1.$name             = "Fast_sensor";
adc1.adcClockPrescaler = "ADC_CLK_DIV_4_0";
adc1.enabledSOCs       = ["ADC_SOC_NUMBER0","ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5","ADC_SOC_NUMBER6","ADC_SOC_NUMBER7","ADC_SOC_NUMBER8","ADC_SOC_NUMBER9"];
adc1.soc0Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc0SampleWindow  = 20;
adc1.soc0Name          = "Igrid";
adc1.soc1Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc1Channel       = "ADC_CH_ADCIN1";
adc1.soc1SampleWindow  = 20;
adc1.soc1Name          = "Vgrid";
adc1.soc2Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc2Channel       = "ADC_CH_ADCIN2";
adc1.soc2SampleWindow  = 20;
adc1.soc2Name          = "Ibat";
adc1.soc3Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc3Channel       = "ADC_CH_ADCIN3";
adc1.soc3SampleWindow  = 20;
adc1.soc3Name          = "Io";
adc1.soc4Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc4Channel       = "ADC_CH_ADCIN4";
adc1.soc4SampleWindow  = 20;
adc1.soc4Name          = "IL";
adc1.soc5Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc5Channel       = "ADC_CH_ADCIN5";
adc1.soc5SampleWindow  = 20;
adc1.soc5Name          = "SavIo";
adc1.soc6Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc6Channel       = "ADC_CH_ADCIN6";
adc1.soc6SampleWindow  = 20;
adc1.soc6Name          = "Vbus";
adc1.soc7Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc7Channel       = "ADC_CH_ADCIN7";
adc1.soc7SampleWindow  = 20;
adc1.soc7Name          = "Vo";
adc1.soc8Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc8Channel       = "ADC_CH_ADCIN10";
adc1.soc8SampleWindow  = 20;
adc1.soc8Name          = "VBAT";
adc1.soc9Trigger       = "ADC_TRIGGER_EPWM1_SOCA";
adc1.soc9Channel       = "ADC_CH_ADCIN9";
adc1.soc9SampleWindow  = 20;
adc1.soc9Name          = "Reserver1";

adc2.$name             = "Low_sensor";
adc2.adcBase           = "ADCC_BASE";
adc2.adcClockPrescaler = "ADC_CLK_DIV_4_0";
adc2.enabledSOCs       = ["ADC_SOC_NUMBER1","ADC_SOC_NUMBER2","ADC_SOC_NUMBER3","ADC_SOC_NUMBER4","ADC_SOC_NUMBER5"];
adc2.soc1Trigger       = "ADC_TRIGGER_CPU1_TINT0";
adc2.soc1Channel       = "ADC_CH_ADCIN11";
adc2.soc1SampleWindow  = 20;
adc2.soc1Name          = "Tbat";
adc2.soc2Trigger       = "ADC_TRIGGER_CPU1_TINT0";
adc2.soc2SampleWindow  = 20;
adc2.soc2Name          = "Tmos1";
adc2.soc3Trigger       = "ADC_TRIGGER_CPU1_TINT0";
adc2.soc3Channel       = "ADC_CH_ADCIN1";
adc2.soc3SampleWindow  = 20;
adc2.soc3Name          = "Reserver2";
adc2.soc4Trigger       = "ADC_TRIGGER_CPU1_TINT0";
adc2.soc4Channel       = "ADC_CH_ADCIN4";
adc2.soc4SampleWindow  = 20;
adc2.soc4Name          = "Reserver3";
adc2.soc5Trigger       = "ADC_TRIGGER_CPU1_TINT0";
adc2.soc5Channel       = "ADC_CH_ADCIN7";
adc2.soc5SampleWindow  = 20;
adc2.soc5Name          = "Reserver4";

const analog  = scripting.addModule("/driverlib/analog.js", {}, false);
const analog1 = analog.addInstance({}, false);
analog1.$name = "myANALOGPinMux0";
adc1.analog   = analog1;
adc2.analog   = analog1;
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "$assign");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a0/c15Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a1Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a10/c10Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a11/c0Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a12/c1Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a14/c4Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a15/c7Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a2/c9Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a3/c5/vdacPin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a4/c14Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a5/c2Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a6Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a7/c3Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a8/c11Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "a9/c8Pin");
scripting.suppress("Solution may have changed,No suggested solution was provided, so this value may differ from the last time this tool was run", analog1.analog, "c6Pin");

// I2C removed - manually initialized in InitI2C()
// i2c1.$name                     = "myI2C0";
// i2c1.bitCount                  = "I2C_BITCOUNT_8";
// i2c1.bitRate                   = 400000;
// i2c1.duty                      = "I2C_DUTYCYCLE_33";
// i2c1.targetAddress             = 0x57;
// i2c1.emulationMode             = "I2C_EMULATION_FREE_RUN";
// i2c1.useFifo                   = false;
// i2c1.i2c.$assign               = "I2CA";
// i2c1.i2c.i2c_sdaPin.$assign    = "GPIO26";
// i2c1.i2c.i2c_sclPin.$assign    = "GPIO33";

cputimer1.$name                    = "myCPUTIMER0";
cputimer1.enableInterrupt          = true;
cputimer1.registerInterrupts       = true;
cputimer1.timerPeriod              = 5000;
cputimer1.timerInt.enableInterrupt = true;

